# TODO  Напишите функцию count_letters
def count_letters(main_str):
    dict_count = {x: main_str.count(x) for x in main_str}

    return dict_count


# TODO Напишите функцию calculate_frequency
def calculate_frequency(dict_):

    dict_frequency = {key: (round(dict_[key] / len(main_str), 2)) for (key, value) in dict_.items()}

    return dict_frequency


main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

main_str = [x for x in main_str if x.isalpha()]

main_str = ''.join(main_str).lower()

dict_ = count_letters(main_str)
dict_frequency = calculate_frequency(dict_)

# TODO Распечатайте в столбик букву и её частоту в тексте
for key, value in dict_frequency.items():
    print(f'{key}: {value:.2f}')